import pytest


@pytest.fixture
def get_filtred_dict_valid():
    return [{"Дата операции": "04.02.2025 21:00:00", "Статус": "OK", "Банк": "Тинькофф"},
            {"Дата операции": "03.02.2025 12:00:00", "Статус": "OK", "Банк": "Тинькофф"},
            {"Дата операции": "06.04.2025 12:00:00", "Статус": "OK", "Банк": "Тинькофф"},
            {"Дата операции": "03.04.2025 12:00:00", "Статус": "NOT OK", "Банк": "Тинькофф"}]


@pytest.fixture
def get_cards_data_valid():
    return [{"Дата операции": "04.02.2025 21:00:00", "Статус": "OK", "Банк": "Тинькофф", "Номер карты": "*9999",
             "Сумма платежа": 1124},
            {"Дата операции": "03.02.2025 12:00:00", "Статус": "OK", "Банк": "Тинькофф", "Номер карты": "*9998",
             "Сумма платежа": -112},
            {"Дата операции": "03.02.2025 11:00:00", "Статус": "OK", "Банк": "Тинькофф", "Номер карты": "*9998",
             "Сумма платежа": -88},
            {"Дата операции": "06.04.2025 12:00:00", "Статус": "OK", "Банк": "Тинькофф", "Номер карты": "*9989",
             "Сумма платежа": 1124},
            {"Дата операции": "03.04.2025 12:00:00", "Статус": "NOT OK", "Банк": "Тинькофф", "Номер карты": "*9899",
             "Сумма платежа": 124}]


@pytest.fixture
def get_top_transactions_valid():
    return [{"Дата платежа": "05.02.2025 12:01:00", "Категория": "OK", "Описание": "Тинькофф", "Номер карты": "*9998",
             "Сумма платежа": -112},
            {"Дата платежа": "05.02.2025 12:01:01", "Категория": "OK", "Описание": "Тинькофф", "Номер карты": "*9998",
             "Сумма платежа": -110},
            {"Дата платежа": "05.02.2025 11:00:00", "Категория": "OK", "Описание": "Тинькофф", "Номер карты": "*9998",
             "Сумма платежа": -88},
            {"Дата платежа": "05.04.2025 13:00:00", "Категория": "OK", "Описание": "Тинькофф", "Номер карты": "*9989",
             "Сумма платежа": 1124},
            {"Дата платежа": "05.04.2025 14:00:00", "Категория": "OK", "Описание": "Тинькофф", "Номер карты": "*9989",
             "Сумма платежа": 1200},
            {"Дата платежа": "05.04.2025 15:00:00", "Категория": "OK", "Описание": "Тинькофф", "Номер карты": "*9989",
             "Сумма платежа": 1300}]


@pytest.fixture
def get_top_transactions_valid_result():
    return [
        {
            "date": "05.04.2025 15:00:00",
            "amount": 1300,
            "category": "OK",
            "description": "Тинькофф",
        },
        {
            "date": "05.04.2025 14:00:00",
            "amount": 1200,
            "category": "OK",
            "description": "Тинькофф",
        },
        {
            "date": "05.04.2025 13:00:00",
            "amount": 1124,
            "category": "OK",
            "description": "Тинькофф",
        },
        {
            "date": "05.02.2025 12:01:00",
            "amount": -112,
            "category": "OK",
            "description": "Тинькофф",
        },
        {
            "date": "05.02.2025 12:01:01",
            "amount": -110,
            "category": "OK",
            "description": "Тинькофф"}]


@pytest.fixture
def currency_and_stock():
    return {"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "AMZN"]}


@pytest.fixture
def get_rate_valid():
    return [{'success': True, 'base': 'usd', 'date': '2026-02-11', 'rates': {'rub': "77.464511159276951242"},
             'last_update_unix': '1770905103'},
            {'success': True, 'base': 'eur', 'date': '2026-02-11',
             'rates': {'rub': "92.02977587"}, 'last_update_unix': '1770905103'}]
