import pandas as pd
import pytest


@pytest.fixture
def get_filtred_dict_valid() -> list[dict]:
    return [
        {"Дата операции": "04.02.2025 21:00:00", "Статус": "OK", "Банк": "Тинькофф"},
        {"Дата операции": "03.02.2025 12:00:00", "Статус": "OK", "Банк": "Тинькофф"},
        {"Дата операции": "06.04.2025 12:00:00", "Статус": "OK", "Банк": "Тинькофф"},
        {"Дата операции": "03.04.2025 12:00:00", "Статус": "NOT OK", "Банк": "Тинькофф"},
    ]


@pytest.fixture
def get_cards_data_valid() -> list[dict]:
    return [
        {
            "Дата операции": "04.02.2025 21:00:00",
            "Статус": "OK",
            "Банк": "Тинькофф",
            "Номер карты": "*9999",
            "Сумма платежа": 1124,
        },
        {
            "Дата операции": "03.02.2025 12:00:00",
            "Статус": "OK",
            "Банк": "Тинькофф",
            "Номер карты": "*9998",
            "Сумма платежа": -112,
        },
        {
            "Дата операции": "03.02.2025 11:00:00",
            "Статус": "OK",
            "Банк": "Тинькофф",
            "Номер карты": "*9998",
            "Сумма платежа": -88,
        },
        {
            "Дата операции": "06.04.2025 12:00:00",
            "Статус": "OK",
            "Банк": "Тинькофф",
            "Номер карты": "*9989",
            "Сумма платежа": 1124,
        },
        {
            "Дата операции": "03.04.2025 12:00:00",
            "Статус": "NOT OK",
            "Банк": "Тинькофф",
            "Номер карты": "*9899",
            "Сумма платежа": 124,
        },
    ]


@pytest.fixture
def get_top_transactions_valid() -> list[dict]:
    return [
        {
            "Дата платежа": "05.02.2025 12:01:00",
            "Категория": "OK",
            "Описание": "Тинькофф",
            "Номер карты": "*9998",
            "Сумма платежа": -112,
        },
        {
            "Дата платежа": "05.02.2025 12:01:01",
            "Категория": "OK",
            "Описание": "Тинькофф",
            "Номер карты": "*9998",
            "Сумма платежа": -110,
        },
        {
            "Дата платежа": "05.02.2025 11:00:00",
            "Категория": "OK",
            "Описание": "Тинькофф",
            "Номер карты": "*9998",
            "Сумма платежа": -88,
        },
        {
            "Дата платежа": "05.04.2025 13:00:00",
            "Категория": "OK",
            "Описание": "Тинькофф",
            "Номер карты": "*9989",
            "Сумма платежа": 1124,
        },
        {
            "Дата платежа": "05.04.2025 14:00:00",
            "Категория": "OK",
            "Описание": "Тинькофф",
            "Номер карты": "*9989",
            "Сумма платежа": 1200,
        },
        {
            "Дата платежа": "05.04.2025 15:00:00",
            "Категория": "OK",
            "Описание": "Тинькофф",
            "Номер карты": "*9989",
            "Сумма платежа": 1300,
        },
    ]


@pytest.fixture
def get_top_transactions_valid_result() -> list[dict]:
    return [
        {
            "date": "05.04.2025 15:00:00",
            "amount": 1300,
            "category": "OK",
            "description": "Тинькофф",
        },
        {
            "date": "05.04.2025 14:00:00",
            "amount": 1200,
            "category": "OK",
            "description": "Тинькофф",
        },
        {
            "date": "05.04.2025 13:00:00",
            "amount": 1124,
            "category": "OK",
            "description": "Тинькофф",
        },
        {
            "date": "05.02.2025 12:01:00",
            "amount": -112,
            "category": "OK",
            "description": "Тинькофф",
        },
        {"date": "05.02.2025 12:01:01", "amount": -110, "category": "OK", "description": "Тинькофф"},
    ]


@pytest.fixture
def currency_and_stock() -> dict:
    return {"user_currencies": ["USD", "EUR"], "user_stocks": ["AAPL", "AMZN"]}


@pytest.fixture
def get_rate_valid() -> list[dict]:
    return [
        {
            "success": True,
            "base": "usd",
            "date": "2026-02-11",
            "rates": {"rub": "77.464511159276951242"},
            "last_update_unix": "1770905103",
        },
        {
            "success": True,
            "base": "eur",
            "date": "2026-02-11",
            "rates": {"rub": "92.02977587"},
            "last_update_unix": "1770905103",
        },
    ]


@pytest.fixture
def currency_and_not_stock() -> dict:
    return {"user_currencies": ["USD", "EUR"], "user_stocks": []}


@pytest.fixture
def test_root_function_valid_1() -> dict:
    return {
        "greeting": "Добрый день",
        "cards": [
            {"last_digits": "4556", "total_spent": 8541.02, "cashback": 85.41},
            {"last_digits": "7197", "total_spent": 3158.03, "cashback": 31.58},
        ],
        "top_transactions": [
            {
                "date": "16.01.2020",
                "amount": 3100.0,
                "category": "Пополнения",
                "description": "Внесение наличных через банкомат Тинькофф",
            },
            {"date": "16.01.2020", "amount": 2130.0, "category": "Пополнения", "description": "Перевод с карты"},
            {"date": "15.01.2020", "amount": -2127.32, "category": "Другое", "description": "ГУП ВЦКП ЖХ"},
            {"date": "19.01.2020", "amount": 2100.0, "category": "Пополнения", "description": "Перевод с карты"},
            {"date": "17.01.2020", "amount": -2100.0, "category": "Переводы", "description": "Перевод на карту"},
        ],
        "currency_rates": [{"currency": "USD", "rate": 77.25}, {"currency": "EUR", "rate": 91.58}],
        "stock_prices": [
            {"stock": "AAPL", "price": 20218.14},
            {"stock": "AMZN", "price": 15418.72},
            {"stock": "GOOGL", "price": 23869.66},
            {"stock": "MSFT", "price": 31041.37},
            {"stock": "TSLA", "price": 32217.86},
        ],
    }


@pytest.fixture
def get_transactions_tel_valid() -> list[dict]:
    return [
        {
            "Дата операции": "10.01.2018 12:59:23",
            "Дата платежа": "10.01.2018",
            "Номер карты": "nan",
            "Статус": "OK",
            "Сумма операции": 30000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 30000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Пополнения",
            "MCC": 6012.0,
            "Описание": "Перевод с карты",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 30000.0,
        },
        {
            "Дата операции": "10.01.2018 12:43:34",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*5441",
            "Статус": "FAILED",
            "Сумма операции": -30068.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -30068.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "nan",
            "MCC": "nan",
            "Описание": "Я МТС +7 921 11-22-33",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 30068.0,
        },
        {
            "Дата операции": "10.01.2018 12:42:44",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*5441",
            "Статус": "FAILED",
            "Сумма операции": -40068.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -40068.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "nan",
            "MCC": "nan",
            "Описание": "Перевод с карты",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 40068.0,
        },
        {
            "Дата операции": "10.01.2018 12:41:24",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*5441",
            "Статус": "FAILED",
            "Сумма операции": -87068.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -87068.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "nan",
            "MCC": "nan",
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 87068.0,
        },
        {
            "Дата операции": "08.01.2018 21:29:43",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -364.49,
            "Валюта операции": "RUB",
            "Сумма платежа": -364.49,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Дикси",
            "Бонусы (включая кэшбэк)": 7,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 364.49,
        },
    ]


@pytest.fixture
def get_transactions_tel_valid_result() -> list[dict]:
    return [
        {
            "Дата операции": "10.01.2018 12:43:34",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*5441",
            "Статус": "FAILED",
            "Сумма операции": -30068.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -30068.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "nan",
            "MCC": "nan",
            "Описание": "Я МТС +7 921 11-22-33",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 30068.0,
        },
        {
            "Дата операции": "10.01.2018 12:41:24",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*5441",
            "Статус": "FAILED",
            "Сумма операции": -87068.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -87068.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "nan",
            "MCC": "nan",
            "Описание": "Тинькофф Мобайл +7 995 555-55-55",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 87068.0,
        },
    ]


@pytest.fixture
def get_transactions_not_tel() -> list[dict]:
    return [
        {
            "Дата операции": "10.01.2018 12:59:23",
            "Дата платежа": "10.01.2018",
            "Номер карты": "nan",
            "Статус": "OK",
            "Сумма операции": 30000.0,
            "Валюта операции": "RUB",
            "Сумма платежа": 30000.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Пополнения",
            "MCC": 6012.0,
            "Описание": "Перевод с карты",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 30000.0,
        },
        {
            "Дата операции": "10.01.2018 12:43:34",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*5441",
            "Статус": "FAILED",
            "Сумма операции": -30068.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -30068.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "nan",
            "MCC": "nan",
            "Описание": "Я МТС",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 30068.0,
        },
        {
            "Дата операции": "10.01.2018 12:42:44",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*5441",
            "Статус": "FAILED",
            "Сумма операции": -40068.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -40068.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "nan",
            "MCC": "nan",
            "Описание": "Перевод с карты",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 40068.0,
        },
        {
            "Дата операции": "10.01.2018 12:41:24",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*5441",
            "Статус": "FAILED",
            "Сумма операции": -87068.0,
            "Валюта операции": "RUB",
            "Сумма платежа": -87068.0,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "nan",
            "MCC": "nan",
            "Описание": "Тинькофф Мобайл",
            "Бонусы (включая кэшбэк)": 0,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 87068.0,
        },
        {
            "Дата операции": "08.01.2018 21:29:43",
            "Дата платежа": "10.01.2018",
            "Номер карты": "*7197",
            "Статус": "OK",
            "Сумма операции": -364.49,
            "Валюта операции": "RUB",
            "Сумма платежа": -364.49,
            "Валюта платежа": "RUB",
            "Кэшбэк": "nan",
            "Категория": "Супермаркеты",
            "MCC": 5411.0,
            "Описание": "Дикси",
            "Бонусы (включая кэшбэк)": 7,
            "Округление на инвесткопилку": 0,
            "Сумма операции с округлением": 364.49,
        },
    ]


@pytest.fixture()
def spending_by_weekday_valid() -> pd.DataFrame:
    return pd.DataFrame(
        [
            {"Дата операции": "10.01.2026 13:01:22", "Статус": "OK", "Сумма операции": -27068.0},
            {
                "Дата операции": "10.01.2026 13:00:04",
                "Дата платежа": "10.01.2018",
                "Статус": "OK",
                "Сумма операции": -30000.0,
            },
            {
                "Дата операции": "10.01.2026 12:59:23",
                "Дата платежа": "10.01.2018",
                "Статус": "OK",
                "Сумма операции": 36000.0,
            },
            {
                "Дата операции": "09.01.2026 12:43:34",
                "Дата платежа": "10.01.2018",
                "Статус": "OK",
                "Сумма операции": -30068.0,
            },
            {
                "Дата операции": "09.01.2026 12:42:44",
                "Дата платежа": "10.01.2018",
                "Статус": "FAILED",
                "Сумма операции": -40068.0,
            },
            {
                "Дата операции": "09.01.2026 12:41:24",
                "Дата платежа": "10.01.2018",
                "Статус": "FAILED",
                "Сумма операции": -87068.0,
            },
            {
                "Дата операции": "08.01.2026 21:29:43",
                "Дата платежа": "10.01.2018",
                "Статус": "OK",
                "Сумма операции": -364.49,
            },
            {
                "Дата операции": "07.01.2026 14:21:23",
                "Дата платежа": "10.01.2018",
                "Статус": "OK",
                "Сумма операции": 250.0,
            },
            {
                "Дата операции": "07.01.2026 13:38:08",
                "Дата платежа": "10.01.2018",
                "Статус": "OK",
                "Сумма операции": -1004.9,
            },
            {
                "Дата операции": "07.01.2026 15:28:22",
                "Дата платежа": "07.01.2018",
                "Статус": "OK",
                "Сумма операции": -79.6,
            },
        ]
    )


@pytest.fixture()
def spending_by_weekday_valid_result() -> dict:
    return {
        "Средние траты в каждый из дней недели за последние три месяца": {
            "Wednesday": 542.25,
            "Thursday": 364.49,
            "Friday": 30068.00,
            "Saturday": 28534.00,
        }
    }
